---
kind: property
id: P:Autodesk.Revit.DB.Definitions.Size
source: html/f66fd77a-ca45-257b-5b86-821829204eb1.htm
---
# Autodesk.Revit.DB.Definitions.Size Property

The number of definitions in the collection.

## Syntax (C#)
```csharp
public int Size { get; }
```